package strings_and_basics_of_text_proccessing.work_with_regExpressions;

/*
Напишите анализатор, позволяющий последовательно возвращать содержимое узлов xml-документа и его
тип (открывающий тег, закрывающий тег, содержимое тега, тег без тела).
* */
public class Task2 {
    public static void main(String[] args) {
        System.out.println('A' + 'B');
    }
}
